---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees
source: html/0658e329-5a00-53f7-79fd-1e960ea14e92.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees

Defines parameters for Structural Tees structural section.

## Syntax (C#)
```csharp
public class StructuralSectionStructuralTees : StructuralSectionGeneralT
```